{
	"articles": [{
	  "image": "https://www.xda-developers.com/files/2019/07/Happy_Mod_1-810x298_c.jpg",
	  "title": "HappyMod",
	  "content": "<p>HappyMod is a platform for developers to publish, test, and download mods for their favorite Android games. HappyMod does not create any of the mods, but has ended up being the most popular host for mods, with over 30,000 hosted file.</p><img width=\"100%\" src=\"https://www.xda-developers.com/files/2019/07/Happy_Mod_1-810x298_c.jpg\">"
	  },{
	  "image": "https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_1-412x732.jpeg",
	  "title": "Why use HappyMod?",
	  "content": "<p>The goal of HappyMods is to make sure that 100% of their hosted mods are working. This means that no matter what mod you download, you can trust that it hasn’t been patched or outdated. All mods should work on the game you’re downloading them for.</p><p>If you need a specific mod that isn’t hosted on the marketplace, you can put in a request for that mod to be developed. You will then be notified when the mod you’ve requested is available to download.</p><img width=\"100%\" src=\"https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_1-412x732.jpeg\">"
	  },{
	  "image": "https://www.xda-developers.com/files/2019/07/Happy_Mod_2.jpg",
	  "title": "Downloading HappyMod on Android",
	  "content": "<p>HappyMod is pretty simple to download, but you do need to install the file onto your Android device manually. Here’s how to do it:</p><ol><li>Open your browser and download the HappyMod APK file.</li><li>Open Android Settings and go into Privacy or Security.</li><li>Tap the option to Allow Unknown Sources and enable it</li><li>Go to your Android downloads and tap the APK file.</li><li>Follow the directions on the screen to install it.</li><li>When the HappyMod icon is on your screen, you can start downloading as many modified files as you want</li></ol><img width=\"100%\" src=\"https://www.xda-developers.com/files/2019/07/Happy_Mod_2.jpg\">"
	  },{
	  "image": "https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_2-412x732.jpeg",
	  "title": "HappyMod App Features",
	  "content": "<p>HappyMod offers Android users a comprehensive set of features, including:</p><ul><li><b>Modified Apps – </b>HappyMod offers more modified apps than any other unofficial app store, sometimes several different versions of the same app, each offering additional features.</li><li><b>Old App Versions – </b>older devices and new app versions don’t always go together, or you might just prefer an older version of an app or game.</li><li><b>Trending Apps – </b>lots of modded versions of popular trending apps and games, like Tetris, PuBG, Subway Surfers, and many more</li><li><b>User-Friendly – </b>easy to use and navigate, HappyMod is as user-friendly as the official store.</li><li><b>Mod Parameters – </b>Mod Parameters – each app has a list of parameters, telling you what modification is one each one.</li></ul><img width=\"100%\" src=\"https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_2-412x732.jpeg\">"
	  },{
	  "image": "https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_3-412x732.jpeg",
	  "title": "How Does HappyMod Work?",
	  "content": "<p>HappyMod really isn’t all that different from the Play Store. It may not offer the same amount of apps and games, but it indeed focuses on quality and on modified apps that Google won’t allow into their store. Every app or game is modified, and it offers several versions of some apps, each offering a different modification. </p><img width=\"100%\" src=\"https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_3-412x732.jpeg\">"
	  },{
	  "image": "https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_4-412x732.jpeg",
	  "title": "Unofficial Games",
	  "content": "<p><b>Unofficial Games – </b>many of the more popular games in the store require you to pay for them or, at the very least, make in-app purchases if you want to advance. Those Purchases often include coins, gems, and powerups, but with HappyMod, you get all of these in-app features for free.</p><img width=\"100%\" src=\"https://androidapksfree.com/wp-content/uploads/2019/10/Screenshot_HappyMod_4-412x732.jpeg\">"
	  },{
	  "image": "https://img.utdstc.com/screen/7dc/24a/7dc24a731512e25d45c03505194c05a3db66124c8f203b5b2ecd67d58152a458:800",
	  "title": "Familiar and User-Friendly",
	  "content": "<p><b>Familiar and User-Friendly – </b>HappyMod has a similar user interface to the official store, and it is straightforward to navigate. Simply choose an app category and download any app or game you want. Choose from categories such as Games, App, and New, where you will find the latest uploads to the store. Even better, you can run the official store and HappyMod at the same time.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/7dc/24a/7dc24a731512e25d45c03505194c05a3db66124c8f203b5b2ecd67d58152a458:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/398/8f3/3988f377c7e804040d2e01d6dc4968bee04fc5883fe54da776169431085f39a6:800",
	  "title": "Mod Changelogs",
	  "content": "<p><b>Mod Changelogs – </b>each app has a changelog attached to it. This tells you what the modifications are and is useful where there are multiple versions of the same app – with the changelog, and you can see which app you want to download.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/398/8f3/3988f377c7e804040d2e01d6dc4968bee04fc5883fe54da776169431085f39a6:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/880/f10/880f102456f509ebb5e62216bdef30826370666286ffce104856fccad19e8000:800",
	  "title": "Updating HappyMod",
	  "content": "<p>All apps need to be updated, whether they are official or unofficial. The updates are released to add content, make improvements, fix bugs, improve security and performance, and improve your user experience. When an app you download via HappyMod requires updating, the HappyMod developers let you know via a notification and give you full instructions on how to download the update and apply it.</p><p>Sometimes, the developers may even release an update to the HappyMod store, but, unlike the official store, you don’t have to install these. The official store will not work unless you install updates, but HappyMod gives you a choice. So, unless the update is to fix a bug or increase security, you can ignore it.</p><p>However, you should bear in mind that failure to install updates may mean your version of the store is not safe, and the developers will not take any responsibility for this, mainly if the update contains security updates,</p><p>HappyMod is one of the most comprehensive of all the alternatives to the Android app store. It offers everything the official store doesn’t – modified apps, unofficial games, and much more. Once again, we must stress that you are downloading and using the app at your own risk as it is classed as a pirate store and isn’t entirely legal.</p><p>Try HappyMod on your Android device today. It’s completely free, you do not need to root your device, and it may just offer everything you have been looking for in an alternative app store.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/880/f10/880f102456f509ebb5e62216bdef30826370666286ffce104856fccad19e8000:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/a0f/a62/a0fa62e7fa45e0563c010fbd96b2f86cc63921d895d18e88ff386d541a16f382:800",
	  "title": "How to request mod in \\n HappyMod?",
	  "content": "<center><b>Step 1: Sign up and login</b></center><p>HappyMod supports you login with facebook and username.</p><p>Sometimes you may meet this problem, the download in your downloading queue all failed, marked as try it later. we recommend you delete all of them, because this time even you try to click the button again, it won't start.</p><center><b>Step 2: Find the game you want to request</b><center><p>Find the game you want to request and click the request button.</p><center><b>Step 3: Fill out the mod detail</b><center><p>Fill out the mod detail then click submit</p><p>Tips: You can also search the app you want to request</p><p>Go to account tab, find my request list, then click the \"+\" button. Search the app you want to request.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/a0f/a62/a0fa62e7fa45e0563c010fbd96b2f86cc63921d895d18e88ff386d541a16f382:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/904/2a2/9042a23bad7b6318553c286343381c371eb699410bf4b9eb3318455c6e85d812:800",
	  "title": "How to upload mod in \\n HappyMod?",
	  "content": "<center><b>Step 1: Sign up accound and login.</b></center><p>Happymod supports you sign up with facebook and username. The username can not use capital, it is the most important condition to find your password back, keep username in mind. If you want to login another device, please remeber your password, the telephone number and email can be useful when you need find the password back.</p><center><b>Step 2: Find the app you want to upload.</b></center><p>Find the app you want to upload, and click the upload button.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/904/2a2/9042a23bad7b6318553c286343381c371eb699410bf4b9eb3318455c6e85d812:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/ad3/68b/ad368bd6aa30ed3feec42644bb79768c531efb8f5ea68b1b71ceeebf1f13f70d:800",
	  "title": "How to improve the success \\n of uploading mod app?",
	  "content": "<p>Firstly, thanks too much for those players who uploaded the mod apps on HappyMod App. If you want the mod app you uploaded can be published successfully on HappyMod App. You should fill in the relevant information accurately.</p><ul><li>You need to make sure the mod app you will upload corresponds to the original app. You can not upload a minecraft mod app on Subway Surfer app page. Or, you will be rejected.</li><li>You need upload a APK file download link on first column. And the download link should be zippyshare and medfire for now. You need make sure the download link is about APK file, not the exe,jpg, mp3, video, zip and any other file formats. You also need be careful the download links works, don't add any other thing on the link. For example, if you add a letter on the download link, the download link will not work, you will be reject.</li><li>You can add Obb download link if this app require it. If you miss the Obb download links while this app need it. You will be rejected.</li><li>You can add a youtube video link about the mod app.If you don't have one, it is ok, just not fill in anything. Remember don't upload the video link which is not related to this mod app. Otherwise you will be rejected.</li><li>You need fill in the mod info about the mod you upload. The language is better to be English. You need to write clearly what the mod app has modified. Don't fill in any other irrelevant information such as details about the original app. Otherwise you will be rejected.</li><li>You need upload at least one screenshot to prove the mod app you upload is working. Don't upload any irrelevant pictures. Or you will be rejected.</li></ul><img width=\"100%\" src=\"https://img.utdstc.com/screen/ad3/68b/ad368bd6aa30ed3feec42644bb79768c531efb8f5ea68b1b71ceeebf1f13f70d:800\">"
	  },{
	  "image": "https://img.utdstc.com/screen/d4f/c18/d4fc181c92daa7d06455bcce88f81750bfa618127a0362c3ad5773ec89ee182d:800",
	  "title": "Why the mod app I \\n uploaded was rejected?",
	  "content": "<p>There are many reasons why the mod app uploaded by the users is rejected. One main reason is that many users do not fill in right information about the mod app according the upload requirements of HappyMod App. Many users filled in the wrong download link, wrong mod info and uploaded the wrong pictures. So these uploads will be rejected. Another main reason is that many users will upload the same mod apk files for one game. Only one of those mod app will be published. Other Mod apps will be rejected. For example, there are hundreds of users will upload the mod for Among us. Only a few of these mods will be pulished because most of mod apk files are same.</p><img width=\"100%\" src=\"https://img.utdstc.com/screen/d4f/c18/d4fc181c92daa7d06455bcce88f81750bfa618127a0362c3ad5773ec89ee182d:800\">"
	  }],
	"pubpage": [{
	  "isOnlineLink": true,
	  "pageContentOrLink": "https://play.google.com/store/apps/details?id=com.mathapp1.educationtips"
	}]
  }